abnormalvis/Mspm0g3507_competition_template/MSPM0G3507_Project_template/ncontroller.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "MSPM0G350X" --part "Default" --package "LQFP-64(PM)" --product "mspm0_sdk@2.02.00.05"
 * @v2CliArgs --device "MSPM0G3507" --package "LQFP-64(PM)" --product "mspm0_sdk@2.02.00.05"
 * @versions {"tool":"1.21.1+3772"}
 */

/**
 * Import the modules used in this configuration.
 */
const ADC12         = scripting.addModule("/ti/driverlib/ADC12", {}, false);
const ADC121        = ADC12.addInstance();
const GPIO          = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1         = GPIO.addInstance();
const GPIO2         = GPIO.addInstance();
const GPIO3         = GPIO.addInstance();
const GPIO4         = GPIO.addInstance();
const GPIO5         = GPIO.addInstance();
const GPIO6         = GPIO.addInstance();
const GPIO7         = GPIO.addInstance();
const GPIO8         = GPIO.addInstance();
const GPIO9         = GPIO.addInstance();
const GPIO10        = GPIO.addInstance();
const GPIO11        = GPIO.addInstance();
const GPIO12        = GPIO.addInstance();
const GPIO13        = GPIO.addInstance();
const GPIO14        = GPIO.addInstance();
const GPIO15        = GPIO.addInstance();
const PWM           = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1          = PWM.addInstance();
const SPI           = scripting.addModule("/ti/driverlib/SPI", {}, false);
const SPI1          = SPI.addInstance();
const SPI2          = SPI.addInstance();
const SYSCTL        = scripting.addModule("/ti/driverlib/SYSCTL");
const SYSTICK       = scripting.addModule("/ti/driverlib/SYSTICK");
const TIMER         = scripting.addModule("/ti/driverlib/TIMER", {}, false);
const TIMER1        = TIMER.addInstance();
const TIMER2        = TIMER.addInstance();
const TIMER3        = TIMER.addInstance();
const UART          = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1         = UART.addInstance();
const UART2         = UART.addInstance();
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */
const divider7       = system.clockTree["PLL_PDIV"];
divider7.divideValue = 4;

const divider9       = system.clockTree["UDIV"];
divider9.divideValue = 2;

const gate7  = system.clockTree["MFCLKGATE"];
gate7.enable = true;

const multiplier2         = system.clockTree["PLL_QDIV"];
multiplier2.multiplyValue = 20;

const mux8       = system.clockTree["HSCLKMUX"];
mux8.inputSelect = "HSCLKMUX_SYSPLL0";

ADC121.$name                      = "ADC12_0";
ADC121.peripheral.adcPin0.$assign = "PA27";
ADC121.adcPin0Config.$name        = "ti_driverlib_gpio_GPIOPinGeneric15";

const Board                       = scripting.addModule("/ti/driverlib/Board", {}, false);
Board.peripheral.$assign          = "DEBUGSS";
Board.peripheral.swclkPin.$assign = "PA20";
Board.peripheral.swdioPin.$assign = "PA19";

GPIO1.$name                         = "PORTB";
GPIO1.associatedPins.create(3);
GPIO1.associatedPins[0].$name       = "RST";
GPIO1.associatedPins[0].pin.$assign = "PB16";
GPIO1.associatedPins[1].$name       = "DC";
GPIO1.associatedPins[1].pin.$assign = "PB17";
GPIO1.associatedPins[2].$name       = "CS";
GPIO1.associatedPins[2].pin.$assign = "PB20";

GPIO2.$name                              = "RGB_Blue";
GPIO2.port                               = "PORTB";
GPIO2.associatedPins[0].$name            = "PIN_22";
GPIO2.associatedPins[0].assignedPin      = "22";
GPIO2.associatedPins[0].internalResistor = "PULL_DOWN";

GPIO3.$name                              = "RGB_Red";
GPIO3.port                               = "PORTB";
GPIO3.associatedPins[0].internalResistor = "PULL_DOWN";
GPIO3.associatedPins[0].$name            = "PIN_26";
GPIO3.associatedPins[0].assignedPin      = "26";

GPIO4.$name                              = "RGB_GREEN";
GPIO4.port                               = "PORTB";
GPIO4.associatedPins[0].internalResistor = "PULL_DOWN";
GPIO4.associatedPins[0].$name            = "PIN_27";
GPIO4.associatedPins[0].assignedPin      = "27";

GPIO5.$name                              = "GPIO_Key_up";
GPIO5.port                               = "PORTB";
GPIO5.associatedPins[0].$name            = "PIN_13";
GPIO5.associatedPins[0].direction        = "INPUT";
GPIO5.associatedPins[0].assignedPin      = "13";
GPIO5.associatedPins[0].internalResistor = "PULL_UP";

GPIO6.$name                              = "GPIO_Key_down";
GPIO6.port                               = "PORTB";
GPIO6.associatedPins[0].$name            = "PIN_19";
GPIO6.associatedPins[0].direction        = "INPUT";
GPIO6.associatedPins[0].internalResistor = "PULL_UP";
GPIO6.associatedPins[0].assignedPin      = "19";

GPIO7.$name                              = "GPIO_Key_left";
GPIO7.port                               = "PORTB";
GPIO7.associatedPins[0].direction        = "INPUT";
GPIO7.associatedPins[0].internalResistor = "PULL_UP";
GPIO7.associatedPins[0].$name            = "PIN_23";
GPIO7.associatedPins[0].assignedPin      = "23";

GPIO8.$name                              = "GPIO_Key_right";
GPIO8.port                               = "PORTB";
GPIO8.associatedPins[0].$name            = "PIN_18";
GPIO8.associatedPins[0].direction        = "INPUT";
GPIO8.associatedPins[0].assignedPin      = "18";
GPIO8.associatedPins[0].internalResistor = "PULL_UP";

GPIO9.$name                              = "GPIO_Key_medium";
GPIO9.port                               = "PORTB";
GPIO9.associatedPins[0].$name            = "PIN_24";
GPIO9.associatedPins[0].direction        = "INPUT";
GPIO9.associatedPins[0].assignedPin      = "24";
GPIO9.associatedPins[0].internalResistor = "PULL_UP";

GPIO10.$name                               = "GPIO_EXIT";
GPIO10.associatedPins.create(4);
GPIO10.associatedPins[0].$name             = "PIN_29";
GPIO10.associatedPins[0].direction         = "INPUT";
GPIO10.associatedPins[0].assignedPin       = "29";
GPIO10.associatedPins[0].interruptEn       = true;
GPIO10.associatedPins[0].interruptPriority = "1";
GPIO10.associatedPins[0].assignedPort      = "PORTA";
GPIO10.associatedPins[0].polarity          = "RISE_FALL";
GPIO10.associatedPins[1].$name             = "PIN_30";
GPIO10.associatedPins[1].assignedPin       = "30";
GPIO10.associatedPins[1].direction         = "INPUT";
GPIO10.associatedPins[1].interruptEn       = true;
GPIO10.associatedPins[1].interruptPriority = "1";
GPIO10.associatedPins[1].assignedPort      = "PORTA";
GPIO10.associatedPins[1].polarity          = "RISE_FALL";
GPIO10.associatedPins[2].$name             = "PIN_5";
GPIO10.associatedPins[2].assignedPin       = "5";
GPIO10.associatedPins[2].direction         = "INPUT";
GPIO10.associatedPins[2].interruptEn       = true;
GPIO10.associatedPins[2].interruptPriority = "1";
GPIO10.associatedPins[2].assignedPort      = "PORTA";
GPIO10.associatedPins[2].polarity          = "RISE_FALL";
GPIO10.associatedPins[3].$name             = "PIN_6";
GPIO10.associatedPins[3].assignedPort      = "PORTA";
GPIO10.associatedPins[3].assignedPin       = "6";
GPIO10.associatedPins[3].direction         = "INPUT";
GPIO10.associatedPins[3].interruptEn       = true;
GPIO10.associatedPins[3].interruptPriority = "1";
GPIO10.associatedPins[3].polarity          = "RISE_FALL";

GPIO11.$name                         = "GPIO_TB6612";
GPIO11.port                          = "PORTA";
GPIO11.associatedPins.create(4);
GPIO11.associatedPins[0].$name       = "TB6612_PIN_24";
GPIO11.associatedPins[0].assignedPin = "24";
GPIO11.associatedPins[0].pin.$assign = "PA24";
GPIO11.associatedPins[1].$name       = "TB6612_PIN_25";
GPIO11.associatedPins[1].assignedPin = "25";
GPIO11.associatedPins[1].pin.$assign = "PA25";
GPIO11.associatedPins[2].$name       = "TB6612_PIN_26";
GPIO11.associatedPins[2].assignedPin = "26";
GPIO11.associatedPins[2].pin.$assign = "PA26";
GPIO11.associatedPins[3].$name       = "TB6612_PIN_22";
GPIO11.associatedPins[3].assignedPin = "22";
GPIO11.associatedPins[3].pin.$assign = "PA22";

GPIO12.$name                              = "GPIO_GREY6";
GPIO12.port                               = "PORTB";
GPIO12.associatedPins.create(6);
GPIO12.associatedPins[0].direction        = "INPUT";
GPIO12.associatedPins[0].$name            = "GREY_PIN_5";
GPIO12.associatedPins[0].internalResistor = "PULL_DOWN";
GPIO12.associatedPins[0].assignedPin      = "5";
GPIO12.associatedPins[0].pin.$assign      = "PB5";
GPIO12.associatedPins[1].$name            = "GREY_PIN_6";
GPIO12.associatedPins[1].direction        = "INPUT";
GPIO12.associatedPins[1].internalResistor = "PULL_DOWN";
GPIO12.associatedPins[1].assignedPin      = "6";
GPIO12.associatedPins[1].pin.$assign      = "PB6";
GPIO12.associatedPins[2].$name            = "GREY_PIN_9";
GPIO12.associatedPins[2].direction        = "INPUT";
GPIO12.associatedPins[2].assignedPin      = "9";
GPIO12.associatedPins[2].internalResistor = "PULL_DOWN";
GPIO12.associatedPins[2].pin.$assign      = "PB9";
GPIO12.associatedPins[3].$name            = "GREY_PIN_8";
GPIO12.associatedPins[3].direction        = "INPUT";
GPIO12.associatedPins[3].assignedPin      = "8";
GPIO12.associatedPins[3].internalResistor = "PULL_DOWN";
GPIO12.associatedPins[3].pin.$assign      = "PB8";
GPIO12.associatedPins[4].$name            = "GREY_PIN_4";
GPIO12.associatedPins[4].direction        = "INPUT";
GPIO12.associatedPins[4].internalResistor = "PULL_DOWN";
GPIO12.associatedPins[4].assignedPin      = "4";
GPIO12.associatedPins[4].pin.$assign      = "PB4";
GPIO12.associatedPins[5].$name            = "GREY_PIN_7";
GPIO12.associatedPins[5].direction        = "INPUT";
GPIO12.associatedPins[5].internalResistor = "PULL_DOWN";
GPIO12.associatedPins[5].assignedPin      = "7";
GPIO12.associatedPins[5].pin.$assign      = "PB7";

